userName="경민" #카멜(낙타표기법)-> 변수,파일이름 (파이썬에서는 잘 사용하지 않음)
UserId="donga" #파스칼규칙 (대명사)->변수에서 사용하지 않음!!!
user_age=40 #소문자 스네이크 문법->변수,파일이름 (파이썬에서 권장하는 변수명)
USER_LEVEL=99  #대문자 스네이크 문법 -> 상수 (바뀌지 않는 값, 변수처럼 값을 저장하는 데 바뀌지 않는 것)

PI=3.1415 #파이썬은 불변(상수)을 정의할 수 없다, 그냥 대문자 스네이크 문법을 쓰면 상수라고 약속함

PI=2.15 # 다른 프로그래밍 언어는 상수를 바꾸려고 하면 오류발생!
#우리회사 서버에 최대 접속 인원
MAX_CONNECT=99
URL="https://naver.com"


#1user="경민" #모든 프로그래밍 언어에서 불가능!!!
user1="경민"
user2="경만"

user_Name="고길동" #가능은 하지만 하면 안됨!!! (카멜+스네이크, 파일이름은 절대절대 불가!!)

print(10-9) # - 빼기연산
#user-name="경민" # - 연산으로 취급, css class 명으로 많이 사용됨!





