#속성이나 메소드를 참조하는 연산 
#문자열 데이터 특별한 기능이 숨어있는데  "." 으로 참조할 수 있다.
#문자열은 여러기능을 가지고 있는데 이런 데이터를 객체라 부른다!
#수학적 연산이 가능한 데이터를 값이라 부르고 여러 기능을 가진 데이터를 객체라 한다.
#문자열은 +* 연산이 가능하지만 수학적 연산이 아니기 때문에 객체라 부르는 것이 맞다!
#.은 객체의 기능이 속성을 참조하는 참조 연산자이다! 

#** 파이썬을 제외한 모든 언어는 값(기본형데이터와) 객체를 구분함
#파이썬은 구분없이 모든 데이터 타입이 객체다!

phone="010.1234.5678" #전화번호
print(phone.replace(".","-")) # 010-1234-5678
print("010*3456*7788")
print("010*3456*7788".replace("*","_"))

print(phone.split("."))

#학생의 점수들 
student1=97
student2=77
student3=88
student_arr=[97,77,88] #배열 : 순서가 있는 어떤 데이터를 모아서 정리
say="안녕하세요!"
say_arr=["안","녕","하","세","요","!"] #문자열이 실제로 저장된 방식(문자의 배열)
print(say[0],say_arr[0])
print(say[2:],say_arr[2:])


print("안녕 경민코딩".split(" "))
print(list("안녕 경민코딩"))  #문자열을 배열로 변경


print("python".upper())
print("GEMINI".lower())
say="      안녕 경민~~    "
print(say,"임의")
print(say.strip(),"임의")
#순서는 0부터 시작 (미국식)
#길이는 1부터 시작 
print("길이",len("abcdefg"))
print(list("abcdefg"))






